In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:easwari@localhost

In [3]:
%%sql
use `date time`;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [5]:
%%sql
show tables;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('orders',)]

In [7]:
%%sql
select * from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, datetime.datetime(2023, 1, 10, 9, 30), datetime.datetime(2023, 1, 12, 14, 0), 101, Decimal('150.00')),
 (2, datetime.datetime(2023, 2, 15, 11, 0), datetime.datetime(2023, 2, 17, 10, 30), 102, Decimal('200.00')),
 (3, datetime.datetime(2023, 3, 20, 14, 15), datetime.datetime(2023, 3, 25, 9, 0), 103, Decimal('350.00')),
 (4, datetime.datetime(2023, 4, 1, 8, 45), datetime.datetime(2023, 4, 3, 13, 30), 104, Decimal('100.00')),
 (5, datetime.datetime(2023, 5, 12, 12, 0), datetime.datetime(2023, 5, 15, 11, 15), 105, Decimal('250.00')),
 (6, datetime.datetime(2023, 6, 30, 10, 30), datetime.datetime(2023, 7, 1, 14, 45), 106, Decimal('400.00')),
 (7, datetime.datetime(2023, 7, 25, 15, 0), datetime.datetime(2023, 7, 28, 9, 30), 107, Decimal('300.00'))]

In [8]:
%%sql
desc orders;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('order_id', 'int', 'NO', 'PRI', None, ''),
 ('order_date', 'datetime', 'YES', '', None, ''),
 ('ship_date', 'datetime', 'YES', '', None, ''),
 ('customer_id', 'int', 'YES', '', None, ''),
 ('amount', 'decimal(10,2)', 'YES', '', None, '')]

--> current_time() function is used to find current time

In [10]:
%%sql
select current_time() as `current time`;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(datetime.timedelta(seconds=80437),)]

In [11]:
%%sql
select  ship_date from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0),),
 (datetime.datetime(2023, 2, 17, 10, 30),),
 (datetime.datetime(2023, 3, 25, 9, 0),),
 (datetime.datetime(2023, 4, 3, 13, 30),),
 (datetime.datetime(2023, 5, 15, 11, 15),),
 (datetime.datetime(2023, 7, 1, 14, 45),),
 (datetime.datetime(2023, 7, 28, 9, 30),)]

--> year() is used to extract year from date

In [13]:
%%sql
select  ship_date, year(ship_date) as `year` from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), 2023),
 (datetime.datetime(2023, 2, 17, 10, 30), 2023),
 (datetime.datetime(2023, 3, 25, 9, 0), 2023),
 (datetime.datetime(2023, 4, 3, 13, 30), 2023),
 (datetime.datetime(2023, 5, 15, 11, 15), 2023),
 (datetime.datetime(2023, 7, 1, 14, 45), 2023),
 (datetime.datetime(2023, 7, 28, 9, 30), 2023)]

In [14]:
%%sql
select  ship_date, month(ship_date) as `month` from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), 1),
 (datetime.datetime(2023, 2, 17, 10, 30), 2),
 (datetime.datetime(2023, 3, 25, 9, 0), 3),
 (datetime.datetime(2023, 4, 3, 13, 30), 4),
 (datetime.datetime(2023, 5, 15, 11, 15), 5),
 (datetime.datetime(2023, 7, 1, 14, 45), 7),
 (datetime.datetime(2023, 7, 28, 9, 30), 7)]

In [16]:
%%sql
select  ship_date, monthname(ship_date) as `month name` from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), 'January'),
 (datetime.datetime(2023, 2, 17, 10, 30), 'February'),
 (datetime.datetime(2023, 3, 25, 9, 0), 'March'),
 (datetime.datetime(2023, 4, 3, 13, 30), 'April'),
 (datetime.datetime(2023, 5, 15, 11, 15), 'May'),
 (datetime.datetime(2023, 7, 1, 14, 45), 'July'),
 (datetime.datetime(2023, 7, 28, 9, 30), 'July')]

In [17]:
%%sql
select  ship_date, day(ship_date) as `day` from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), 12),
 (datetime.datetime(2023, 2, 17, 10, 30), 17),
 (datetime.datetime(2023, 3, 25, 9, 0), 25),
 (datetime.datetime(2023, 4, 3, 13, 30), 3),
 (datetime.datetime(2023, 5, 15, 11, 15), 15),
 (datetime.datetime(2023, 7, 1, 14, 45), 1),
 (datetime.datetime(2023, 7, 28, 9, 30), 28)]

In [18]:
%%sql
select  ship_date, dayname(ship_date) as `day name` from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), 'Thursday'),
 (datetime.datetime(2023, 2, 17, 10, 30), 'Friday'),
 (datetime.datetime(2023, 3, 25, 9, 0), 'Saturday'),
 (datetime.datetime(2023, 4, 3, 13, 30), 'Monday'),
 (datetime.datetime(2023, 5, 15, 11, 15), 'Monday'),
 (datetime.datetime(2023, 7, 1, 14, 45), 'Saturday'),
 (datetime.datetime(2023, 7, 28, 9, 30), 'Friday')]

In [19]:
%%sql
select  ship_date, dayname(ship_date) as `day name`, dayofweek(ship_date) as `day of week`
from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), 'Thursday', 5),
 (datetime.datetime(2023, 2, 17, 10, 30), 'Friday', 6),
 (datetime.datetime(2023, 3, 25, 9, 0), 'Saturday', 7),
 (datetime.datetime(2023, 4, 3, 13, 30), 'Monday', 2),
 (datetime.datetime(2023, 5, 15, 11, 15), 'Monday', 2),
 (datetime.datetime(2023, 7, 1, 14, 45), 'Saturday', 7),
 (datetime.datetime(2023, 7, 28, 9, 30), 'Friday', 6)]

In [20]:
%%sql
select  ship_date, dayname(ship_date) as `day name`, dayofyear(ship_date) as `day of year`
from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), 'Thursday', 12),
 (datetime.datetime(2023, 2, 17, 10, 30), 'Friday', 48),
 (datetime.datetime(2023, 3, 25, 9, 0), 'Saturday', 84),
 (datetime.datetime(2023, 4, 3, 13, 30), 'Monday', 93),
 (datetime.datetime(2023, 5, 15, 11, 15), 'Monday', 135),
 (datetime.datetime(2023, 7, 1, 14, 45), 'Saturday', 182),
 (datetime.datetime(2023, 7, 28, 9, 30), 'Friday', 209)]

In [21]:
%%sql
select  ship_date, hour(ship_date), minute(ship_date), second(ship_date)
from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), 14, 0, 0),
 (datetime.datetime(2023, 2, 17, 10, 30), 10, 30, 0),
 (datetime.datetime(2023, 3, 25, 9, 0), 9, 0, 0),
 (datetime.datetime(2023, 4, 3, 13, 30), 13, 30, 0),
 (datetime.datetime(2023, 5, 15, 11, 15), 11, 15, 0),
 (datetime.datetime(2023, 7, 1, 14, 45), 14, 45, 0),
 (datetime.datetime(2023, 7, 28, 9, 30), 9, 30, 0)]

In [4]:
%%sql
select * from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, datetime.datetime(2023, 1, 10, 9, 30), datetime.datetime(2023, 1, 12, 14, 0), 101, Decimal('150.00')),
 (2, datetime.datetime(2023, 2, 15, 11, 0), datetime.datetime(2023, 2, 17, 10, 30), 102, Decimal('200.00')),
 (3, datetime.datetime(2023, 3, 20, 14, 15), datetime.datetime(2023, 3, 25, 9, 0), 103, Decimal('350.00')),
 (4, datetime.datetime(2023, 4, 1, 8, 45), datetime.datetime(2023, 4, 3, 13, 30), 104, Decimal('100.00')),
 (5, datetime.datetime(2023, 5, 12, 12, 0), datetime.datetime(2023, 5, 15, 11, 15), 105, Decimal('250.00')),
 (6, datetime.datetime(2023, 6, 30, 10, 30), datetime.datetime(2023, 7, 1, 14, 45), 106, Decimal('400.00')),
 (7, datetime.datetime(2023, 7, 25, 15, 0), datetime.datetime(2023, 7, 28, 9, 30), 107, Decimal('300.00'))]

In [5]:
%%sql
desc orders;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('order_id', 'int', 'NO', 'PRI', None, ''),
 ('order_date', 'datetime', 'YES', '', None, ''),
 ('ship_date', 'datetime', 'YES', '', None, ''),
 ('customer_id', 'int', 'YES', '', None, ''),
 ('amount', 'decimal(10,2)', 'YES', '', None, '')]

In [16]:
%%sql
select order_date, 
year(order_date) as `year`,
month(order_date) as `month`,
monthname(order_date) as `month name`,
day(order_date) as `day`,
dayname(order_date) as `day name`,
dayofweek(order_date) as `day of week`,
dayofyear(order_date) as `day of year`
from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 10, 9, 30), 2023, 1, 'January', 10, 'Tuesday', 3, 10),
 (datetime.datetime(2023, 2, 15, 11, 0), 2023, 2, 'February', 15, 'Wednesday', 4, 46),
 (datetime.datetime(2023, 3, 20, 14, 15), 2023, 3, 'March', 20, 'Monday', 2, 79),
 (datetime.datetime(2023, 4, 1, 8, 45), 2023, 4, 'April', 1, 'Saturday', 7, 91),
 (datetime.datetime(2023, 5, 12, 12, 0), 2023, 5, 'May', 12, 'Friday', 6, 132),
 (datetime.datetime(2023, 6, 30, 10, 30), 2023, 6, 'June', 30, 'Friday', 6, 181),
 (datetime.datetime(2023, 7, 25, 15, 0), 2023, 7, 'July', 25, 'Tuesday', 3, 206)]

In [22]:
%%sql
select *,
datediff(ship_date, order_date) as `no of days taken for delivery`
from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, datetime.datetime(2023, 1, 10, 9, 30), datetime.datetime(2023, 1, 12, 14, 0), 101, Decimal('150.00'), 2),
 (2, datetime.datetime(2023, 2, 15, 11, 0), datetime.datetime(2023, 2, 17, 10, 30), 102, Decimal('200.00'), 2),
 (3, datetime.datetime(2023, 3, 20, 14, 15), datetime.datetime(2023, 3, 25, 9, 0), 103, Decimal('350.00'), 5),
 (4, datetime.datetime(2023, 4, 1, 8, 45), datetime.datetime(2023, 4, 3, 13, 30), 104, Decimal('100.00'), 2),
 (5, datetime.datetime(2023, 5, 12, 12, 0), datetime.datetime(2023, 5, 15, 11, 15), 105, Decimal('250.00'), 3),
 (6, datetime.datetime(2023, 6, 30, 10, 30), datetime.datetime(2023, 7, 1, 14, 45), 106, Decimal('400.00'), 1),
 (7, datetime.datetime(2023, 7, 25, 15, 0), datetime.datetime(2023, 7, 28, 9, 30), 107, Decimal('300.00'), 3)]

In [11]:
%%sql
select ship_date,
date_add(ship_date, interval 1 day) as `one_day_after_shipdate`,
date_sub(ship_date, interval 1 day) as `one_day_before_shipdate`
from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(datetime.datetime(2023, 1, 12, 14, 0), datetime.datetime(2023, 1, 13, 14, 0), datetime.datetime(2023, 1, 11, 14, 0)),
 (datetime.datetime(2023, 2, 17, 10, 30), datetime.datetime(2023, 2, 18, 10, 30), datetime.datetime(2023, 2, 16, 10, 30)),
 (datetime.datetime(2023, 3, 25, 9, 0), datetime.datetime(2023, 3, 26, 9, 0), datetime.datetime(2023, 3, 24, 9, 0)),
 (datetime.datetime(2023, 4, 3, 13, 30), datetime.datetime(2023, 4, 4, 13, 30), datetime.datetime(2023, 4, 2, 13, 30)),
 (datetime.datetime(2023, 5, 15, 11, 15), datetime.datetime(2023, 5, 16, 11, 15), datetime.datetime(2023, 5, 14, 11, 15)),
 (datetime.datetime(2023, 7, 1, 14, 45), datetime.datetime(2023, 7, 2, 14, 45), datetime.datetime(2023, 6, 30, 14, 45)),
 (datetime.datetime(2023, 7, 28, 9, 30), datetime.datetime(2023, 7, 29, 9, 30), datetime.datetime(2023, 7, 27, 9, 30))]

--> find the current date

In [25]:
%%sql
select current_date() as `current_date`;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(datetime.date(2024, 10, 28),)]

--> find the current date

In [26]:
%%sql
select current_time() as `current_time`;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(datetime.timedelta(seconds=39309),)]

In [31]:
%%sql
CREATE TABLE employees (
    employee_id INT,
    name VARCHAR(50),
    join_date DATE,
    exit_date DATE
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [33]:
%%sql
INSERT INTO employees (employee_id, name, join_date, exit_date) VALUES
(1, 'Janani', '2022-03-15', '2023-05-20'),
(2, 'Kutty', '2021-06-01', '2024-10-28'),
(3, 'Bairo', '2020-01-10', '2024-08-18'),
(4, 'Lavanya', '2023-02-25', '2023-12-31'),
(5, 'Rohitha', '2019-07-15', '2024-10-01');

 * mysql+pymysql://root:***@localhost
5 rows affected.

[]

In [42]:
%%sql
select *,
timestampdiff(day,join_date,exit_date) as `no of worked days`,
timestampdiff(week,join_date,exit_date) as `no of worked weeks`,
timestampdiff(month,join_date,exit_date) as `no of worked months`,
timestampdiff(quarter,join_date,exit_date) as `no of worked quarter`,
timestampdiff(year,join_date,exit_date) as `no of worked years`
from employees;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[(1, 'Janani', datetime.date(2022, 3, 15), datetime.date(2023, 5, 20), 431, 61, 14, 4, 1),
 (2, 'Kutty', datetime.date(2021, 6, 1), datetime.date(2024, 10, 28), 1245, 177, 40, 13, 3),
 (3, 'Bairo', datetime.date(2020, 1, 10), datetime.date(2024, 8, 18), 1682, 240, 55, 18, 4),
 (4, 'Lavanya', datetime.date(2023, 2, 25), datetime.date(2023, 12, 31), 309, 44, 10, 3, 0),
 (5, 'Rohitha', datetime.date(2019, 7, 15), datetime.date(2024, 10, 1), 1905, 272, 62, 20, 5)]

In [43]:
%%sql
CREATE TABLE sales (
    sale_id INT,
    sale_date DATE,
    salesperson VARCHAR(50),
    region VARCHAR(50),
    sale_amount DECIMAL(10, 2)
);

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [44]:
%%sql
INSERT INTO sales (sale_id, sale_date, salesperson, region, sale_amount) VALUES
-- Sales data for 2023
(1, '2023-01-15', 'Janani', 'North', 5000.00),
(2, '2023-01-25', 'Kutty', 'East', 3000.00),
(3, '2023-02-10', 'Bairo', 'West', 7000.00),
(4, '2023-02-20', 'Lavanya', 'South', 6500.00),
(5, '2023-03-12', 'Rohitha', 'North', 8000.00),
(6, '2023-03-25', 'Lakshith', 'East', 2000.00),
(7, '2023-04-15', 'Darshith', 'West', 5500.00),
(8, '2023-04-28', 'Janani', 'South', 6000.00),

-- Sales data for 2024
(9, '2024-01-05', 'Kutty', 'North', 6200.00),
(10, '2024-01-20', 'Lavanya', 'East', 7200.00),
(11, '2024-02-12', 'Rohitha', 'West', 8700.00),
(12, '2024-02-27', 'Lakshith', 'South', 7800.00),
(13, '2024-03-14', 'Darshith', 'North', 9300.00),
(14, '2024-03-30', 'Janani', 'East', 4300.00),
(15, '2024-04-10', 'Kutty', 'West', 8500.00),
(16, '2024-04-22', 'Lavanya', 'South', 7300.00);

 * mysql+pymysql://root:***@localhost
16 rows affected.

[]

In [45]:
%%sql
select * from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, datetime.datetime(2023, 1, 10, 9, 30), datetime.datetime(2023, 1, 12, 14, 0), 101, Decimal('150.00')),
 (2, datetime.datetime(2023, 2, 15, 11, 0), datetime.datetime(2023, 2, 17, 10, 30), 102, Decimal('200.00')),
 (3, datetime.datetime(2023, 3, 20, 14, 15), datetime.datetime(2023, 3, 25, 9, 0), 103, Decimal('350.00')),
 (4, datetime.datetime(2023, 4, 1, 8, 45), datetime.datetime(2023, 4, 3, 13, 30), 104, Decimal('100.00')),
 (5, datetime.datetime(2023, 5, 12, 12, 0), datetime.datetime(2023, 5, 15, 11, 15), 105, Decimal('250.00')),
 (6, datetime.datetime(2023, 6, 30, 10, 30), datetime.datetime(2023, 7, 1, 14, 45), 106, Decimal('400.00')),
 (7, datetime.datetime(2023, 7, 25, 15, 0), datetime.datetime(2023, 7, 28, 9, 30), 107, Decimal('300.00'))]

In [51]:
%%sql
select *,
month(order_date) as `month`,
sum(amount) over(order by month(order_date)) as `month over month sales`
from orders;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, datetime.datetime(2023, 1, 10, 9, 30), datetime.datetime(2023, 1, 12, 14, 0), 101, Decimal('150.00'), 1, Decimal('150.00')),
 (2, datetime.datetime(2023, 2, 15, 11, 0), datetime.datetime(2023, 2, 17, 10, 30), 102, Decimal('200.00'), 2, Decimal('350.00')),
 (3, datetime.datetime(2023, 3, 20, 14, 15), datetime.datetime(2023, 3, 25, 9, 0), 103, Decimal('350.00'), 3, Decimal('700.00')),
 (4, datetime.datetime(2023, 4, 1, 8, 45), datetime.datetime(2023, 4, 3, 13, 30), 104, Decimal('100.00'), 4, Decimal('800.00')),
 (5, datetime.datetime(2023, 5, 12, 12, 0), datetime.datetime(2023, 5, 15, 11, 15), 105, Decimal('250.00'), 5, Decimal('1050.00')),
 (6, datetime.datetime(2023, 6, 30, 10, 30), datetime.datetime(2023, 7, 1, 14, 45), 106, Decimal('400.00'), 6, Decimal('1450.00')),
 (7, datetime.datetime(2023, 7, 25, 15, 0), datetime.datetime(2023, 7, 28, 9, 30), 107, Decimal('300.00'), 7, Decimal('1750.00'))]

In [57]:
%%sql
select *,
month(order_date) as `month`,
sum(amount) over(order by month(order_date)) as `month over month sales`
from orders

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, datetime.datetime(2023, 1, 10, 9, 30), datetime.datetime(2023, 1, 12, 14, 0), 101, Decimal('150.00'), 1, Decimal('150.00')),
 (2, datetime.datetime(2023, 2, 15, 11, 0), datetime.datetime(2023, 2, 17, 10, 30), 102, Decimal('200.00'), 2, Decimal('350.00')),
 (3, datetime.datetime(2023, 3, 20, 14, 15), datetime.datetime(2023, 3, 25, 9, 0), 103, Decimal('350.00'), 3, Decimal('700.00')),
 (4, datetime.datetime(2023, 4, 1, 8, 45), datetime.datetime(2023, 4, 3, 13, 30), 104, Decimal('100.00'), 4, Decimal('800.00')),
 (5, datetime.datetime(2023, 5, 12, 12, 0), datetime.datetime(2023, 5, 15, 11, 15), 105, Decimal('250.00'), 5, Decimal('1050.00')),
 (6, datetime.datetime(2023, 6, 30, 10, 30), datetime.datetime(2023, 7, 1, 14, 45), 106, Decimal('400.00'), 6, Decimal('1450.00')),
 (7, datetime.datetime(2023, 7, 25, 15, 0), datetime.datetime(2023, 7, 28, 9, 30), 107, Decimal('300.00'), 7, Decimal('1750.00'))]

In [59]:
%%sql
with `month_wise_total_sales` as
(
select *,
month(order_date) as `month`,
sum(amount) over(order by month(order_date)) as `month over month sales`
from orders
)
, `current and previous sales` as
(
select *,
lag(`month over month sales`,1,0) over(order by month) as `previous month sales`
from `month_wise_total_sales`
)
select * from `current and previous sales`;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, datetime.datetime(2023, 1, 10, 9, 30), datetime.datetime(2023, 1, 12, 14, 0), 101, Decimal('150.00'), 1, Decimal('150.00'), Decimal('0.00')),
 (2, datetime.datetime(2023, 2, 15, 11, 0), datetime.datetime(2023, 2, 17, 10, 30), 102, Decimal('200.00'), 2, Decimal('350.00'), Decimal('150.00')),
 (3, datetime.datetime(2023, 3, 20, 14, 15), datetime.datetime(2023, 3, 25, 9, 0), 103, Decimal('350.00'), 3, Decimal('700.00'), Decimal('350.00')),
 (4, datetime.datetime(2023, 4, 1, 8, 45), datetime.datetime(2023, 4, 3, 13, 30), 104, Decimal('100.00'), 4, Decimal('800.00'), Decimal('700.00')),
 (5, datetime.datetime(2023, 5, 12, 12, 0), datetime.datetime(2023, 5, 15, 11, 15), 105, Decimal('250.00'), 5, Decimal('1050.00'), Decimal('800.00')),
 (6, datetime.datetime(2023, 6, 30, 10, 30), datetime.datetime(2023, 7, 1, 14, 45), 106, Decimal('400.00'), 6, Decimal('1450.00'), Decimal('1050.00')),
 (7, datetime.datetime(2023, 7, 25, 15, 0), datetime.datetime(2023, 7, 28, 9, 30), 107, Decimal('300.00'), 7, Decimal('1750.00'), Decimal('1450.00'))]

In [56]:
%%sql
with `month_wise_total_sales` as
(
select *,
month(order_date) as `month`,
sum(amount) over(order by month(order_date)) as `month over month sales`
from orders
)
, `current and previous sales` as
(
select *,
lag(`month over month sales`,1,0) over(order by month) as `previous month sales`
from `month_wise_total_sales`
)
select *,
(`month over month sales` - `previous month sales`) as `sales difference between current & previous month`
from `current and previous sales`;

 * mysql+pymysql://root:***@localhost
7 rows affected.

[(1, datetime.datetime(2023, 1, 10, 9, 30), datetime.datetime(2023, 1, 12, 14, 0), 101, Decimal('150.00'), 1, Decimal('150.00'), Decimal('0.00'), Decimal('150.00')),
 (2, datetime.datetime(2023, 2, 15, 11, 0), datetime.datetime(2023, 2, 17, 10, 30), 102, Decimal('200.00'), 2, Decimal('350.00'), Decimal('150.00'), Decimal('200.00')),
 (3, datetime.datetime(2023, 3, 20, 14, 15), datetime.datetime(2023, 3, 25, 9, 0), 103, Decimal('350.00'), 3, Decimal('700.00'), Decimal('350.00'), Decimal('350.00')),
 (4, datetime.datetime(2023, 4, 1, 8, 45), datetime.datetime(2023, 4, 3, 13, 30), 104, Decimal('100.00'), 4, Decimal('800.00'), Decimal('700.00'), Decimal('100.00')),
 (5, datetime.datetime(2023, 5, 12, 12, 0), datetime.datetime(2023, 5, 15, 11, 15), 105, Decimal('250.00'), 5, Decimal('1050.00'), Decimal('800.00'), Decimal('250.00')),
 (6, datetime.datetime(2023, 6, 30, 10, 30), datetime.datetime(2023, 7, 1, 14, 45), 106, Decimal('400.00'), 6, Decimal('1450.00'), Decimal('1050.00'), Decimal('400.00')),
 (7, datetime.datetime(2023, 7, 25, 15, 0), datetime.datetime(2023, 7, 28, 9, 30), 107, Decimal('300.00'), 7, Decimal('1750.00'), Decimal('1450.00'), Decimal('300.00'))]